{
  "personal_details": {
    "name": "Lingamaiah M",
    "role": "Software Engineer",
    "mobile": "+91 7569546490",
    "email": "LingamaiahMcse@gmail.com",
    "location": "Hyderabad",
    "experience": [
      { "type": "Java8/Python3", "years": "4.7+ years" },
      { "type": "Total Experience", "years": "4.7+ years" }
    ],
    "linkedin": "lingamaiahM",
    "github": "lgmcse94"
  },
  "summary": {
    "title": "About me",
    "description": ["A programming geek and experienced Software Engineer with a demonstrated history of working in the software industry.Experienced in Backend Development, implementing Micro services using Java, Python, Julia.Expert in data processing.Experienced in implementing web application end to end.Worked as R&D, Data Engineer, Software Development.<br><b>My Skill Set Matrix:</b>Java, Spring Boot, Micro Services, Python, Flask, Django, Azure, C, C++, Assembly (emu 8086), Lex, Java SE, AWT/SWING, APPLETS, JDBC, Servlet, JSP, J2EE, Web services, Spring Core, Spring MVC, Spring Security, Spring REST, Hibernate, JSoup, JSON org, Shell, VB Script, NLP, NLTK, Stanford Core Lib, Pandas, SQL, MySQL, MsSQL, Cassandra, HBase, Mongo DB, PostgreSQL, Hadoop, Map Reduce, Spark, Scala, PySpark, HDFS, Hive, Pig, Sqoop, Flume, Spark SQL, HBase, Oozie, YARN, Cassandra, MongoDB, Kafka, Resilient Distributed Dataset RDD, Spark Core, Spark SQL, Spark Streaming, Spark ML Lib, Dash Framework, Matplotlib, PyPlot, Plotly, Dev C++, MySQL, Oracle, Tomcat, Nginx, Gunicorn, Load Balancer, SoapUI, SQLPlus, SQLDeveloper, SBT, Anaconda3, Jupyter Notebook, Google Colab, Mac OS X, Linux, Cloudera, Windows, Fedora."
    ]
  },
  "career": {
    "title": "Career Objective",
    "description": "Eager to expand my skill set and a very enthusiastic learner and quick at adaption."
  },
  "companyDetails": {
    "title": "Professional Experience",
    "companyList": [
      {
        "name": "CBRE South Asia Pvt Ltd.",
        "role": "Software Engineer",
        "years": "Oct 2019 - present",
        "description": [
        	"Optimizing the existing services.",
          "Implemented a Java Microservices with Spring Boot for understanding the employees skill set matrix.",
          "Implemented a Microservice APIs for Plans application using Julia language and dockerized it.Implemented a utility for logs sync and rotation.",
          "Implemented a chatbot Microservice APIs and deployed it on cloud microsoft Azure App service.",
          "Implemented a data migration utility,It copies the data from MsSQL/PostgreSQL source db, table to PostgreSQL/MsSQL target db, table."
        ]
      },
      {
        "name": "Oracle India Pvt Ltd.",
        "role": "Applications Engineer",
        "years": "July 2018 - Oct 2019",
        "expYears": "1.25 years",
        "description": [
          "Oracle HCM Cloud(Oracle Integrated Cloud Applications),implemented a algorithm to understand the all producs process execution time when scheduled.Optimized the tasks to finish it quickly.",
          "Oracle HCM Simple Report Generator, It's a web application simple report generator on top of HCM result generator.",
          "Oracle HCM Data Utilities, Implemented a data scanning engine for all the products master/child and other columns info.Storing the data in memory for quick access on large data sets.Used PySpark Created temp tables in memory, Implemented data generation engine from rest APIs using java.Mapped the search result to UI.",
          "Oracle HCM Click History, It’s a production logs analysis and graph generation to track the user flow activity."
        ]
      },
      {
        "name": "ADP India Pvt Ltd.",
        "role": "Member Technical",
        "years": "Oct 2016 - July 2018",
        "expYears": "1.75 years",
        "description": [
          "Implemented a hybrid automation framework using Selenium/Java and introduced to QA in ADP.",
          "Implemented a data processing pipeline for IRVP using big data technologies.",
          "Worked on RSVP/IRVP web application to enhance the functionalities."
        ]
      }
    ]
  },
  "key_projects": {
    "title": "Key Projects / Involvements",
    "description": [
      "In CBRE, Took the initiation for Julia backend Microservice APIs development and started adding new features, when there is no KT and there is no documentation but was able to debug and understood the end to end application flow.I have been invlovoing in organization level R&D project POCs.",
      "In Oracle, Optimized the Oracle HCM Data Utilities project,It used to take around 24 hrs to process all products data, After Optimizing it's taking around 30 mins.",
      "In ADP, Participated in hackathon.Developed Google assistant to obtain daily calendar and pay related info available with ADP.Received appreciation award from director,New jersey,US."
    ]
  },
  "certificates": {
    "title": "Certificates and Awards",
    "description": [
      "Visit my <a href='https://www.linkedin.com/in/lingamaiahmanga' target='_blank'>linkedin</a> profile for latest coding/technologies certificates.",
      "Developed a framework to automate IRVP(iProducts) for North America payroll in the short span of time.Appreciated by India VP-GPT(Global Business solutions) in ADP.",
      "Developed a IRTS project at IIIT first convocation2016.Received Chancellors special appreciation award by Chancellor Raj Reddy, Honorable Chief Minister Mr. Chandrababu Naidu sir.",
      "Acquired 2nd prize in ‘CODING and DECODING’ in SARVAGNYA 2K15 national level technical symposium at JNTU pulivendula.",
      "Acquired mandal 1st rank in X th class year of 2010 and received pratibha award from government of andhra pradesh, india."
    ]
  },
  "skills": {
    "title": "Technical Skills",
    "description": [
      { "name": "Data Processing", "rating": 5 },
      { "name": "JavaSE & J2EE", "rating": 4 },
      { "name": "Spring Boot", "rating": 3 },
      { "name": "Microservices", "rating": 4 },
      { "name": "Restful Services", "rating": 4 },
      { "name": "Flask & Django", "rating": 4 }
    ]
  },
  "expertise": {
    "title": "Areas of Expertise",
    "description": ["Algorithms", "Data Structures", "Java8", "Python3", "Problem solving", "OOPS", "SQL & NoSQL"]
  },
  "methodology": {
    "title": "Methodology / Approach",
    "description": [
      "Agile methodology", "Design Patterns", "TDD", "MVC",  "RESTful architecture", "Microservice architecture"
    ]
  },
  "tools": {
    "title": "Tools",
    "description": ["Git", "CVS", "Oracle ADE", "VS Code", "IntelliJ IDEA", "Eclipse", "Postman"]
  },
  "education": {
    "title": "Education",
    "description": [
      {
        "institution": "International Institute of Information Technology, RK Valley, RGUKT.",
        "years": "2012 - 2016",
        "grade": "8.03",
        "degree": "B.Tech",
        "specialization": "Computer Science and Engineering"
      },
      {
        "institution": "International Institute of Information Technology, RK Valley, RGUKT.",
        "years": "2010 - 2012",
        "grade": "7.09",
        "degree": "PUC",
        "specialization": "M.BI.P.C"
      },
      {
        "institution": "ZPHS, Karwanga",
        "years": "2010",
        "grade": "87.17%",
        "degree": "SSC"
      }
    ]
  }
}
